[
  {
    "id": 1,
    "zid": "cat-deep-home-cleaning",
    "type": "category",
    "subtype": "service",
    "title": "Deep Home Cleaning for Bangkok's Finest Residences",
    "description": "Hotel-standard deep cleaning for luxury homes in Bangkok. Supervised teams, premium natural products, and a satisfaction guarantee. Book your assessment.",
    "permalink": "/services/deep-home-cleaning",
    "content": "<h2>Your Home Deserves More Than a Surface Clean</h2><p>You chose your home for a reason — the view from your Sathorn penthouse, the garden at your Krungthep Kreetha estate, the quiet of your Nichada Thani villa. A home like yours demands cleaning that matches the standard you live by.</p><p>A regular cleaning crew spends a few hours wiping what's visible. They leave behind what you can't immediately see — dust mites breeding in upholstery, mould forming behind bathroom fixtures, grease building inside range hood ducts, allergens trapped in curtain fibres. In Bangkok's tropical humidity, what's invisible today becomes a health problem tomorrow.</p><p>Your family breathes this air. Your children play on these floors. The furnishings you invested in are being slowly degraded. A standard clean gives you the <em>appearance</em> of clean. Khun Clean Elite gives you the reality.</p><h2>What Your Deep Clean Includes</h2><ul><li><strong>Kitchen</strong> — Interior and exterior appliance cleaning, cabinet wipe-down, backsplash degreasing, range hood duct cleaning, floor scrubbing and sanitisation</li><li><strong>Bathrooms</strong> — Grout scrubbing, glass descaling, fixture polishing, mould treatment behind fittings, exhaust fan cleaning, tile restoration</li><li><strong>Bedrooms &amp; Living Areas</strong> — Upholstery deep cleaning, mattress dust mite treatment, curtain freshening, baseboard and skirting detail, air vent cleaning</li><li><strong>Windows &amp; Glass</strong> — Interior glass, tracks, frames, and balcony doors — streak-free and spotless</li><li><strong>Balconies &amp; Terraces</strong> — Pressure washing, drainage clearing, railing and glass balustrade detailing</li><li><strong>Air Quality</strong> — AC filter cleaning, vent sanitisation, and allergen reduction treatment</li></ul><p>Every product is premium, plant-based, and non-toxic — safe for your family, your pets, and your home's finishes. No bleach. No ammonia. No chemical residue lingering in your air conditioning.</p><h2>Trusted Across Bangkok's Finest Neighbourhoods</h2><p>Whether your home is a penthouse overlooking the Chao Phraya near Wireless Road and Langsuan, a family townhouse in Thonglor or Ekkamai, or an executive residence in the Sathorn and Silom financial district — your dedicated assessor comes to you. We serve the embassy belt around Ploenchit and Ratchadamri, the expat communities of Phrom Phong and Ari, and the prestigious mansion estates of Krungthep Kreetha and Pattanakarn.</p><p>Beyond central Bangkok, our teams are trusted by families in Nichada Thani and Pak Kret, the luxury estates along Chaengwattana and Ratchaphruek in Nonthaburi, and residents of The Forestias, the Bangna-Suvarnabhumi corridor, and Bangna-Srinakarin in Samut Prakan.</p>",
    "benefits": [
      {"title": "Hotel-Trained Teams", "text": "Every cleaner is trained in five-star hospitality standards. Your team doesn't just clean — they detail every surface to the level you'd expect from Bangkok's finest hotels."},
      {"title": "Complete Confidentiality", "text": "Your home is your private space. Every team member is vetted, insured, and bound by strict confidentiality. What happens in your home stays in your home."},
      {"title": "Satisfaction Guaranteed", "text": "If any detail isn't right, your supervisor addresses it on the spot. Not satisfied after we leave? We return and re-clean at no charge."}
    ],
    "cover_image": "https://placehold.co/800x600?text=Deep+Home+Cleaning",
    "price": 0,
    "currency": "THB",
    "price_info": "",
    "tags": "deep cleaning,home cleaning,residential,bangkok,sukhumvit,sathorn,thonglor,premium cleaning",
    "pubdate": "2025-06-01T10:00:00Z",
    "inserted_at": "2025-06-01T10:00:00Z",
    "updated_at": "2026-01-15T10:00:00Z",
    "created_by": 1,
    "views": 892
  },
  {
    "id": 3,
    "zid": "cat-move-in-move-out-cleaning",
    "type": "category",
    "subtype": "service",
    "title": "Move-In & Move-Out Cleaning for Premium Properties",
    "description": "Deposit-saving move-out cleans and pristine move-in preparation for Bangkok's finest rentals. Passes the strictest landlord inspections.",
    "permalink": "/services/move-in-move-out-cleaning",
    "content": "<h2>The Financial Stakes Are Too High for a Standard Clean</h2><p>Moving into a Phrom Phong condominium? Leaving a rental in Thonglor? Handing back a house in Nichada Thani? A missed grout stain or greasy range hood can cost you tens of thousands in deposit deductions. And unpacking into someone else's mess is no way to start life in your new home.</p><p>Landlords and property agents across Bangkok's premium rentals — Sukhumvit, Sathorn, Wireless Road, Langsuan — use detailed inspection checklists. They check inside oven doors, behind toilet pedestals, under sink cabinets, above cabinet tops. They run fingers along window tracks and check AC vents for dust. A surface-level clean will fail this inspection. The deductions come straight from your deposit.</p><h2>Your Move-Out Clean</h2><p>Designed to pass even the strictest landlord and agent inspections:</p><ul><li><strong>Walls &amp; Ceilings</strong> — Scuff removal, nail hole filling, spot cleaning, cobweb removal from every corner</li><li><strong>Kitchen</strong> — Range hood degreasing (interior and exterior), oven deep clean, refrigerator sanitisation, cabinet interior wipe-down, backsplash and floor restoration</li><li><strong>Bathrooms</strong> — Grout whitening, limescale removal, silicone mould treatment, mirror and glass polishing, fixture detailing</li><li><strong>Floors</strong> — Tile grout scrubbing, hardwood polishing, vinyl and laminate restoration, baseboard cleaning</li><li><strong>Windows &amp; Balconies</strong> — Full glass cleaning, track cleaning, frame detailing, balcony pressure wash</li><li><strong>AC Units</strong> — Filter cleaning, vent sanitisation, exterior wipe-down — one of the most common inspection failures</li></ul><h2>Your Move-In Clean</h2><p>Walk into a home that feels entirely yours from day one:</p><ul><li>Complete sanitisation of all surfaces before you unpack a single box</li><li>Cabinet, wardrobe, and drawer interior cleaning — because you're putting your belongings inside</li><li>Air conditioning deep clean and filter replacement</li><li>Bathroom sanitisation with mould prevention treatment</li><li>Kitchen appliance interior cleaning — refrigerator, oven, microwave, dishwasher</li><li>Floor deep clean and polish — ready for your furniture placement</li></ul><h2>Trusted for Moves Across Greater Bangkok</h2><p>We handle move cleans in the high-rise condominiums of Thonglor, Phrom Phong, and Ekkamai, the executive apartments along Sathorn and Silom, and the prestigious residences near Wireless Road and Ploenchit. In the Rama 9 corridor and Ari, our teams work with the growing number of premium rentals entering the market.</p><p>Throughout Nonthaburi, we serve the expatriate homes of Nichada Thani and the estates along Chaengwattana and Ratchaphruek-Rattanathibet. In Samut Prakan, our teams clean across the Bangna-Suvarnabhumi corridor, Bangna-Srinakarin, and The Forestias. Moving within Bangkok or arriving from overseas — your assessor meets you at the property.</p>",
    "benefits": [
      {"title": "Deposit Protection", "text": "Your clean is designed to pass the strictest landlord and agent inspections in Bangkok. Every item on their checklist is on ours — so your deposit stays with you."},
      {"title": "Complete Confidentiality", "text": "Moving is a vulnerable time. Every team member is vetted, insured, and bound by strict confidentiality. Your belongings and your privacy are never at risk."},
      {"title": "Fixed-Price Assessment", "text": "Your assessor visits the property, scopes every room, and gives you a fixed price before any work begins. No surprises. No hidden charges."}
    ],
    "cover_image": "https://placehold.co/800x600?text=Move+Cleaning",
    "price": 0,
    "currency": "THB",
    "price_info": "",
    "tags": "move-in,move-out,deposit,cleaning,bangkok,end of lease,landlord inspection",
    "pubdate": "2025-06-01T10:00:00Z",
    "inserted_at": "2025-06-01T10:00:00Z",
    "updated_at": "2026-01-05T10:00:00Z",
    "created_by": 2,
    "views": 623
  },
  {
    "id": 4,
    "zid": "cat-post-construction-cleaning",
    "type": "category",
    "subtype": "service",
    "title": "Post-Construction Cleaning That Protects Your Investment",
    "description": "Specialist renovation and post-construction cleaning for Bangkok's luxury homes. HEPA dust extraction, material-safe methods, and meticulous detail.",
    "permalink": "/services/post-construction-cleaning",
    "content": "<h2>Your Renovation Is Complete. The Dust Isn't.</h2><p>You've spent months — and a significant investment — renovating your home. New marble countertops. Imported hardwood floors. Custom cabinetry throughout. The contractor has packed up. But what they've left behind is a fine layer of construction dust on every surface, paint residue on your new windows, adhesive marks on your floors, and particulates in your air ducts that your family will be breathing for weeks.</p><p>A standard cleaning service doesn't have the equipment, the training, or the team size to handle post-construction cleanup. This is specialised work — and cutting corners means damaging the very finishes you just paid to install.</p><h2>Why Construction Dust Demands a Professional Team</h2><p>Construction dust isn't ordinary household dust. It contains silica particles, cement powder, wood fibres, and chemical compounds from adhesives, sealants, and paints. These particles are fine enough to penetrate upholstery, settle behind outlet covers, and embed in air conditioning systems. In Bangkok's climate, moisture bonds this dust to surfaces, making it harder to remove with each passing day.</p><p>Using the wrong method on new finishes causes real damage — abrasive wiping on fresh paint, acidic cleaners on natural stone, excessive water on unsealed hardwood. Your renovation deserves a team that understands materials and treats every surface correctly.</p><h2>What Your Post-Construction Clean Covers</h2><ul><li><strong>Fine Dust Removal</strong> — Systematic top-down extraction from ceilings, walls, ledges, and every horizontal surface using HEPA-filtered equipment</li><li><strong>Paint &amp; Adhesive Residue</strong> — Careful removal of splatter, tape marks, and adhesive without damaging new finishes</li><li><strong>Window &amp; Glass Restoration</strong> — Sticker removal, construction film peeling, frame cleaning, streak-free glass polishing</li><li><strong>Floor Treatment</strong> — Material-specific cleaning: tile grout clearing, hardwood dust extraction, marble honing preparation, vinyl cleaning</li><li><strong>Fixture &amp; Fitting Detail</strong> — New handles, switches, and fittings cleaned of fingerprints, dust, and installation residue</li><li><strong>Air System Cleaning</strong> — AC duct vacuuming, vent cleaning, and filter replacement to eliminate circulating construction particulates</li><li><strong>Final Sanitisation</strong> — Complete surface sanitisation so your home is safe to live in — not just safe to look at</li></ul><h2>From Penthouse Renovations to Estate Rebuilds</h2><p>Our post-construction teams have cleaned some of Bangkok's most significant residential renovations — penthouse refurbishments along Wireless Road and Langsuan, full-unit renovations in the branded residences along the Chao Phraya, and townhouse upgrades in Thonglor, Ekkamai, and the inner Sukhumvit sois. In Sathorn and Silom, we've handled executive apartment renovations where speed and discretion were essential.</p><p>Across the mansion districts of Krungthep Kreetha and Pattanakarn, we work with homeowners undertaking large-scale estate renovations — coordinating directly with architects and project managers. In Nonthaburi, our teams serve Nichada Thani renovations and the luxury estates along Chaengwattana. In Samut Prakan, we've cleaned newly completed units at The Forestias and throughout the Bangna-Suvarnabhumi development corridor.</p><p>If your contractor is still finishing up, your assessor can visit while work is underway to plan the cleaning timeline around your handover date.</p>",
    "benefits": [
      {"title": "Material-Safe Methods", "text": "Every surface is treated with the correct technique for its finish — no abrasives on paint, no acid on marble, no excess water on hardwood. Your renovation is protected."},
      {"title": "Complete Confidentiality", "text": "Your property and your renovation details remain private. Every team member is vetted, insured, and bound by strict confidentiality agreements."},
      {"title": "Contractor Coordination", "text": "Your supervisor works directly with your architect, interior designer, or project manager to plan timing, access, and sequencing around your handover date."}
    ],
    "cover_image": "https://placehold.co/800x600?text=Post+Construction",
    "price": 0,
    "currency": "THB",
    "price_info": "",
    "tags": "post-construction,renovation,builders clean,bangkok,after renovation,construction cleaning",
    "pubdate": "2025-06-01T10:00:00Z",
    "inserted_at": "2025-06-01T10:00:00Z",
    "updated_at": "2025-12-20T10:00:00Z",
    "created_by": 2,
    "views": 412
  },
  {
    "id": 10,
    "zid": "blog-rainy-season-cleaning",
    "type": "blog",
    "subtype": null,
    "title": "How to Keep Your Bangkok Home Clean During Rainy Season",
    "description": "Bangkok's rainy season brings mould and humidity. Here are expert tips to keep your home fresh, dry, and spotless from June to October.",
    "permalink": "/blog/rainy-season-cleaning-tips-bangkok",
    "content": "<h2>Surviving Rainy Season Without the Mould</h2><p>Bangkok's monsoon season (June–October) brings relentless humidity that can turn your home into a breeding ground for mould and mildew. Here's how to fight back.</p><h3>1. Control Indoor Humidity</h3><p>Keep your AC running in dry mode when you're home. Invest in a dehumidifier for enclosed spaces like walk-in wardrobes and storage rooms. Aim for 50–60% relative humidity indoors.</p><h3>2. Ventilate After Rain</h3><p>Once the downpour stops, open windows to let fresh air circulate. Stale, trapped moisture is mould's best friend.</p><h3>3. Address Mould Immediately</h3><p>Dark spots on walls, ceilings, or grout? Don't ignore them. Mould spreads fast in Bangkok's climate. Use a vinegar-water solution for small patches, or call in professionals for anything larger.</p><h3>4. Wash Fabrics Regularly</h3><p>Curtains, cushion covers, and bedding absorb moisture from the air. Wash them more frequently during rainy season to prevent musty odours.</p><p>Need a professional deep clean to reset your home for the season? <a href='/contact'>Book with Khun Clean Elite</a>.</p>",
    "cover_image": "https://placehold.co/1200x630?text=Rainy+Season+Tips",
    "tags": "rainy season,mould,humidity,cleaning tips,bangkok",
    "pubdate": "2026-01-20T08:00:00Z",
    "inserted_at": "2026-01-20T08:00:00Z",
    "updated_at": "2026-01-20T08:00:00Z",
    "created_by": 1,
    "views": 347
  },
  {
    "id": 11,
    "zid": "blog-condo-cleaning-checklist",
    "type": "blog",
    "subtype": null,
    "title": "The Ultimate Bangkok Condo Cleaning Checklist",
    "description": "A room-by-room cleaning checklist for Bangkok condos. Save time with this structured approach to keeping your condo spotless year-round.",
    "permalink": "/blog/bangkok-condo-cleaning-checklist",
    "content": "<h2>Your Complete Condo Cleaning Checklist</h2><p>Living in a Bangkok condo means dealing with unique challenges — limited storage, shared ventilation, and constant dust from the city. This checklist helps you stay on top of it all.</p><h3>Kitchen</h3><ul><li>Wipe down all countertops and backsplash daily</li><li>Deep clean stovetop and range hood weekly</li><li>Clean refrigerator interior monthly</li><li>Descale kettle and coffee machine monthly</li></ul><h3>Bathroom</h3><ul><li>Squeegee glass after every shower</li><li>Scrub grout lines weekly</li><li>Clean exhaust fan monthly</li><li>Check for mould behind fixtures quarterly</li></ul><h3>Living & Bedroom</h3><ul><li>Dust all surfaces twice weekly</li><li>Vacuum or mop floors weekly</li><li>Wash curtains and cushion covers monthly</li><li>Flip and vacuum mattress quarterly</li></ul><h3>Balcony</h3><ul><li>Sweep weekly</li><li>Clean drainage monthly — Bangkok rain can clog drains fast</li></ul><p>Too busy to keep up? Our <a href='/services/deep-home-cleaning'>deep home cleaning service</a> handles it all on your schedule.</p>",
    "cover_image": "https://placehold.co/1200x630?text=Condo+Checklist",
    "tags": "condo,checklist,cleaning tips,bangkok",
    "pubdate": "2026-01-05T09:00:00Z",
    "inserted_at": "2026-01-05T09:00:00Z",
    "updated_at": "2026-01-05T09:00:00Z",
    "created_by": 2,
    "views": 289
  },
  {
    "id": 12,
    "zid": "blog-eco-friendly-cleaning",
    "type": "blog",
    "subtype": null,
    "title": "Why We Use Eco-Friendly Cleaning Products in Bangkok",
    "description": "Discover why Khun Clean Elite uses green, non-toxic products. Better for your family, pets, and Bangkok's environment.",
    "permalink": "/blog/eco-friendly-cleaning-bangkok",
    "content": "<h2>Green Cleaning for a Better Bangkok</h2><p>At Khun Clean Elite, every product we use is carefully selected to be effective, safe, and environmentally responsible. Here's why it matters.</p><h3>Safe for Families and Pets</h3><p>Conventional cleaning products contain volatile organic compounds (VOCs) that linger in the air long after cleaning. In Bangkok's sealed, air-conditioned condos, these chemicals have nowhere to go. Our plant-based alternatives clean just as effectively without the toxic residue.</p><h3>Effective in Tropical Conditions</h3><p>We source products specifically formulated for tropical climates. They combat mould and bacteria without relying on harsh bleach or ammonia.</p><h3>Reducing Our Environmental Footprint</h3><p>Bangkok generates enormous amounts of wastewater. By using biodegradable products, we ensure our runoff doesn't add to the problem. Our concentrated formulas also mean less plastic packaging.</p><h3>Certifications We Trust</h3><ul><li>EU Ecolabel certified products</li><li>USDA BioPreferred approved</li><li>Cruelty-free and vegan</li></ul><p>Want a clean home without compromising your values? <a href='/contact'>Talk to our team</a> about our green cleaning options.</p>",
    "cover_image": "https://placehold.co/1200x630?text=Eco+Friendly",
    "tags": "eco-friendly,green cleaning,non-toxic,bangkok",
    "pubdate": "2025-12-15T10:00:00Z",
    "inserted_at": "2025-12-15T10:00:00Z",
    "updated_at": "2025-12-15T10:00:00Z",
    "created_by": 1,
    "views": 198
  },
  {
    "id": 13,
    "zid": "blog-move-out-deposit",
    "type": "blog",
    "subtype": null,
    "title": "How to Get Your Full Deposit Back When Moving Out in Bangkok",
    "description": "Moving out of your Bangkok rental? Follow this guide to maximise your deposit return with proper cleaning and landlord inspection prep.",
    "permalink": "/blog/get-deposit-back-bangkok-rental",
    "content": "<h2>Get Every Baht of Your Deposit Back</h2><p>Losing part of your rental deposit is one of the most common frustrations for tenants in Bangkok. Much of the time, deductions come down to cleaning issues that are entirely preventable.</p><h3>Start Early</h3><p>Don't wait until the last day. Begin cleaning at least a week before your move-out inspection. Tackle one room per day so nothing gets missed.</p><h3>Focus on What Landlords Check</h3><ul><li><strong>Walls</strong> — Remove all nails, fill holes with white putty, clean scuff marks</li><li><strong>Kitchen</strong> — Grease buildup on the range hood and oven is the #1 deduction item</li><li><strong>Bathrooms</strong> — Mould in grout, limescale on fixtures, and stained caulking</li><li><strong>Floors</strong> — Scratch marks on wood, stained tiles, and dirty grout</li><li><strong>AC units</strong> — Dirty filters and mouldy vents will cost you</li></ul><h3>Document Everything</h3><p>Take timestamped photos of every room after cleaning. Compare them to your move-in photos for reference.</p><p>Want guaranteed results? Our <a href='/services/move-in-move-out-cleaning'>move-out cleaning service</a> is specifically designed to pass landlord inspections.</p>",
    "cover_image": "https://placehold.co/1200x630?text=Deposit+Tips",
    "tags": "move-out,deposit,rental,tips,bangkok",
    "pubdate": "2025-11-28T08:00:00Z",
    "inserted_at": "2025-11-28T08:00:00Z",
    "updated_at": "2025-11-28T08:00:00Z",
    "created_by": 2,
    "views": 412
  },
  {
    "id": 20,
    "zid": "page-about",
    "type": "page",
    "subtype": null,
    "title": "About Khun Clean Elite",
    "description": "Meet the team behind Bangkok's most trusted premium cleaning service. Hospitality-trained professionals, eco-friendly products.",
    "permalink": "/about",
    "content": "<h2>About Khun Clean Elite</h2><p>Founded in 2020, Khun Clean Elite was born from a simple observation: Bangkok deserved a cleaning service that matched the standards of its world-class hotels and luxury residences.</p><h3>Our Story</h3><p>Our founder, Natcha Srisawat, spent 15 years managing housekeeping operations for five-star hotels across Southeast Asia. She brought that same meticulous attention to detail into the residential and commercial cleaning space — creating a service trusted by embassies, penthouse owners, and discerning families across Bangkok.</p><h3>What Sets Us Apart</h3><ul><li>Hospitality-trained cleaning professionals</li><li>Eco-friendly, non-toxic cleaning products</li><li>Detailed checklists and quality inspections on every job</li><li>Flexible scheduling — including evenings and weekends</li><li>Fully insured with damage guarantee</li></ul><h3>Our Promise</h3><p>If you're not satisfied with any aspect of our work, we'll return and re-clean at no charge. That's our commitment to every client, every time.</p>",
    "cover_image": "https://placehold.co/1200x630?text=About+Us",
    "tags": "",
    "pubdate": "2025-01-01T00:00:00Z",
    "inserted_at": "2025-01-01T00:00:00Z",
    "updated_at": "2026-01-01T00:00:00Z",
    "created_by": 1,
    "views": 534
  },
  {
    "id": 21,
    "zid": "page-privacy",
    "type": "page",
    "subtype": null,
    "title": "Privacy Policy",
    "description": "Khun Clean Elite privacy policy. How we collect, use, and protect your personal information.",
    "permalink": "/privacy",
    "content": "<h2>Privacy Policy</h2><p>Last updated: January 1, 2026</p><p>Khun Clean Elite (\"we\", \"us\", or \"our\") respects your privacy and is committed to protecting your personal data.</p><h3>Information We Collect</h3><p>We collect information you provide directly to us, such as when you request a quote, book a service, contact us, or subscribe to our newsletter. This may include your name, email, phone number, and property address.</p><h3>How We Use Your Information</h3><p>We use the information we collect to provide, maintain, and improve our services, to communicate with you about bookings and promotions, and to comply with Thai data protection regulations (PDPA).</p><h3>Data Protection</h3><p>We implement appropriate security measures to protect your personal data in accordance with the Thailand Personal Data Protection Act (PDPA).</p><h3>Contact Us</h3><p>If you have questions about this privacy policy, please contact us at contact@khuncleanelite.com.</p>",
    "tags": "",
    "pubdate": "2025-01-01T00:00:00Z",
    "inserted_at": "2025-01-01T00:00:00Z",
    "updated_at": "2026-01-01T00:00:00Z",
    "created_by": 1,
    "views": 67
  }
]
